; domain
; Title: FlowFree Domain for Edgy Strategy (made compatible with Fast Downward planners)
; Author: Aditi Basu (University of Melbourne)

(define (domain FlowFree)
    (:requirements :strips :typing :action-costs :conditional-effects)

    (:types
        dot node
    )

    (:predicates
        ; pre-strategy domain predicates
        (head ?n - node ?d - dot)
        (selected ?d - dot)
        (finished ?d - dot)
        (adjacent ?n - node ?n - node)
        (filled ?n - node ?d - dot)

        ; Planimation predicates
        (position ?n - node)
        
        ; Edgy strategy predicates
        (nextToEdge ?n - node)               ; is a node next to an edge?
        (currentPath ?n - node)        ; is a node part of the current path being formed?

        ; Fast-Downward predicates
        (pipe ?n - node)                  ; does a node contain a pipe?

    )

    ; cost function
    (:functions
        (total-cost) - number
    )

    ; move selection from d1 to d2 based on cost
    (:action select-colour
        :parameters     (?d1 - dot
                         ?d2 - dot)

        :precondition   (and 
                            (selected ?d1)
                            (not (selected ?d2))
                            (not (finished ?d2))
                        )

        :effect         (and 
                            (selected ?d2)
                            (not (selected ?d1))
                            (finished ?d1)              
				            
                            (increase (total-cost) 1)
                        )
    )
    
    ; move from n1 to n2 where n2 is NOT nextToEdge
    (:action move
        :parameters     (?n1 - node 
                         ?n2 - node 
                         ?d - dot)

        :precondition   (and 
                            (not (pipe ?n2))
                            (not (filled ?n2 ?d))
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                            (not (nextToEdge ?n2))
                        )
                        
        :effect         (and 
                            (head ?n2 ?d)
                            (pipe ?n2)
                            (currentPath ?n2)
                             
                            ; increment cost as ?n2 is not nextToEdge
                            (increase (total-cost) 1)
                        )
    )
    
     ; move from n1 to n2 where n2 is nextToEdge
    (:action moveNextToEdge
        :parameters     (?n1 - node 
                         ?n2 - node 
                         ?d - dot)

        :precondition   (and 
                            (not (pipe ?n2))
                            (not (filled ?n2 ?d))
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                            (nextToEdge ?n2)
                        )
        :effect         (and 
                            (head ?n2 ?d)
                            (pipe ?n2)
                            (currentPath ?n2)
                            
                            ; no cost increase as ?n2 is nextToEdge
                            (increase (total-cost) 0)
                        )
    )

    ; finish a path by connecting to second dot 
    (:action finishPath
        :parameters     (?n1 - node
                         ?n2 - node
                         ?d - dot)

        :precondition   (and
                            (filled ?n2 ?d) 
                            (selected ?d)
                            (head ?n1 ?d)
                            (not (head ?n2 ?d))
                            (adjacent ?n1 ?n2)
                        ) 

        :effect         (and 
                            (head ?n2 ?d)
                            
                            ; convert nodes adjacent to currentPath nodes to nextToEdge
                            (forall (?cp - node ?n - node) 
                                (when 
                                    (and (currentPath ?cp) (adjacent ?cp ?n))
                                    (nextToEdge ?n)    
                                )
                            )

                            ; reset all currentPath predicates to false 
                            (forall (?x - node)
                                (when 
                                    (currentPath ?x) 
                                    (not (currentPath ?x))
                                )
                            )

                            ; no cost increase as all dots will need to execute this action regardless of initial state
                            (increase (total-cost) 0)
                        )
    )
)

; problem
; Title: FlowFree Problem1-7x7 (Edgy Strategy)
; Author: Aditi Basu

(define (problem FlowFree-7x7)
    (:domain FlowFree)
    (:objects 
        r y g b o c dummy - dot
        node1-7 node2-7 node3-7 node4-7 node5-7 node6-7 node7-7 - node
        node1-6 node2-6 node3-6 node4-6 node5-6 node6-6 node7-6 - node
        node1-5 node2-5 node3-5 node4-5 node5-5 node6-5 node7-5 - node
        node1-4 node2-4 node3-4 node4-4 node5-4 node6-4 node7-4 - node
        node1-3 node2-3 node3-3 node4-3 node5-3 node6-3 node7-3 - node
        node1-2 node2-2 node3-2 node4-2 node5-2 node6-2 node7-2 - node
        node1-1 node2-1 node3-1 node4-1 node5-1 node6-1 node7-1 - node
    )

    (:init
        ; head relations
        (head node1-6 b) (head node2-6 y) (head node6-6 c) (head node7-6 g)
        (head node1-5 o) (head node7-5 r)

        ; filled relations
        ; the 'starting' positions
        (filled node1-6 b) (filled node2-6 y) (filled node6-6 c) (filled node7-6 g)
        (filled node1-5 o) (filled node7-5 r)
        ; the 'destinations'
        (filled node2-5 b) 
        (filled node3-4 y)
        (filled node6-3 c)
        (filled node4-2 o) (filled node6-2 g)
        (filled node1-1 r)

        ; nextToEdge relations - outermost cells
        (nextToEdge node1-1) (nextToEdge node1-2) (nextToEdge node1-3) (nextToEdge node1-4) (nextToEdge node1-5) (nextToEdge node1-6) (nextToEdge node1-7)
        (nextToEdge node2-1)                                                                                                          (nextToEdge node2-7)
        (nextToEdge node3-1)                                                                                                          (nextToEdge node3-7)
        (nextToEdge node4-1)                                                                                                          (nextToEdge node4-7)
        (nextToEdge node5-1)                                                                                                          (nextToEdge node5-7)
        (nextToEdge node6-1)                                                                                                          (nextToEdge node6-7)
        (nextToEdge node7-1) (nextToEdge node7-2) (nextToEdge node7-3) (nextToEdge node7-4) (nextToEdge node7-5) (nextToEdge node7-6) (nextToEdge node7-7)
        
        ; specify initial value of functions
        (= (total-cost) 0)

        ; select dummy dot
        (selected dummy)

        ; pipe relations
        (pipe node1-6) (pipe node2-6) (pipe node6-6) (pipe node7-6)
        (pipe node1-5) (pipe node7-5)
        (pipe node2-5) 
        (pipe node3-4)
        (pipe node6-3)
        (pipe node4-2) (pipe node6-2)
        (pipe node1-1)

        ; adjacent relations
        (adjacent node1-1 node1-2) (adjacent node1-1 node2-1)
        (adjacent node1-2 node1-1) (adjacent node1-2 node2-2) (adjacent node1-2 node1-3)
        (adjacent node1-3 node1-2) (adjacent node1-3 node2-3) (adjacent node1-3 node1-4)
        (adjacent node1-4 node1-3) (adjacent node1-4 node2-4) (adjacent node1-4 node1-5)
        (adjacent node1-5 node1-4) (adjacent node1-5 node2-5) (adjacent node1-5 node1-6)
        (adjacent node1-6 node1-5) (adjacent node1-6 node2-6) (adjacent node1-6 node1-7)
        (adjacent node1-7 node2-7) (adjacent node1-7 node1-6)

        (adjacent node2-1 node1-1) (adjacent node2-1 node3-1) (adjacent node2-1 node2-2)
        (adjacent node2-2 node2-1) (adjacent node2-2 node2-3) (adjacent node2-2 node1-2) (adjacent node2-2 node3-2)
        (adjacent node2-3 node2-2) (adjacent node2-3 node2-4) (adjacent node2-3 node1-3) (adjacent node2-3 node3-3)
        (adjacent node2-4 node2-3) (adjacent node2-4 node2-5) (adjacent node2-4 node1-4) (adjacent node2-4 node3-4)
        (adjacent node2-5 node1-5) (adjacent node2-5 node3-5) (adjacent node2-5 node2-4) (adjacent node2-5 node2-6)
        (adjacent node2-6 node1-6) (adjacent node2-6 node3-6) (adjacent node2-6 node2-5) (adjacent node2-6 node2-7)
        (adjacent node2-7 node1-7) (adjacent node2-7 node3-7) (adjacent node2-7 node2-6)

        (adjacent node3-1 node2-1) (adjacent node3-1 node4-1) (adjacent node3-1 node3-2)
        (adjacent node3-2 node3-1) (adjacent node3-2 node3-3) (adjacent node3-2 node2-2) (adjacent node3-2 node4-2)
        (adjacent node3-3 node3-2) (adjacent node3-3 node3-4) (adjacent node3-3 node2-3) (adjacent node3-3 node4-3)
        (adjacent node3-4 node3-3) (adjacent node3-4 node3-5) (adjacent node3-4 node2-4) (adjacent node3-4 node4-4)
        (adjacent node3-5 node2-5) (adjacent node3-5 node4-5) (adjacent node3-5 node3-4) (adjacent node3-5 node3-6)
        (adjacent node3-6 node2-6) (adjacent node3-6 node4-6) (adjacent node3-6 node3-5) (adjacent node3-6 node3-7)
        (adjacent node3-7 node2-7) (adjacent node3-7 node4-7) (adjacent node3-7 node3-6)

        (adjacent node4-1 node3-1) (adjacent node4-1 node5-1) (adjacent node4-1 node4-2)
        (adjacent node4-2 node4-1) (adjacent node4-2 node4-3) (adjacent node4-2 node3-2) (adjacent node4-2 node5-2)
        (adjacent node4-3 node4-2) (adjacent node4-3 node4-4) (adjacent node4-3 node3-3) (adjacent node4-3 node5-3)
        (adjacent node4-4 node4-3) (adjacent node4-4 node4-5) (adjacent node4-4 node3-4) (adjacent node4-4 node5-4)
        (adjacent node4-5 node3-5) (adjacent node4-5 node5-5) (adjacent node4-5 node4-4) (adjacent node4-5 node4-6)
        (adjacent node4-6 node3-6) (adjacent node4-6 node5-6) (adjacent node4-6 node4-5) (adjacent node4-6 node4-7)
        (adjacent node4-7 node3-7) (adjacent node4-7 node5-7) (adjacent node4-7 node4-6)

        (adjacent node5-1 node4-1) (adjacent node5-1 node6-1) (adjacent node5-1 node5-2)
        (adjacent node5-2 node5-1) (adjacent node5-2 node5-3) (adjacent node5-2 node4-2) (adjacent node5-2 node6-2)
        (adjacent node5-3 node5-2) (adjacent node5-3 node5-4) (adjacent node5-3 node4-3) (adjacent node5-3 node6-3)
        (adjacent node5-4 node5-3) (adjacent node5-4 node5-5) (adjacent node5-4 node4-4) (adjacent node5-4 node6-4)
        (adjacent node5-5 node4-5) (adjacent node5-5 node6-5) (adjacent node5-5 node5-4) (adjacent node5-5 node5-6)
        (adjacent node5-6 node4-6) (adjacent node5-6 node6-6) (adjacent node5-6 node5-5) (adjacent node5-6 node5-7)
        (adjacent node5-7 node4-7) (adjacent node5-7 node6-7) (adjacent node5-7 node5-6)

        (adjacent node6-1 node6-2) (adjacent node6-1 node5-1) (adjacent node6-1 node7-1)
        (adjacent node6-2 node6-1) (adjacent node6-2 node5-2) (adjacent node6-2 node6-3) (adjacent node6-2 node7-2)
        (adjacent node6-3 node6-2) (adjacent node6-3 node5-3) (adjacent node6-3 node6-4) (adjacent node6-3 node7-3)
        (adjacent node6-4 node6-3) (adjacent node6-4 node5-4) (adjacent node6-4 node6-5) (adjacent node6-4 node7-4)
        (adjacent node6-5 node6-4) (adjacent node6-5 node5-5) (adjacent node6-5 node6-6) (adjacent node6-5 node7-5)
        (adjacent node6-6 node6-5) (adjacent node6-6 node5-6) (adjacent node6-6 node6-7) (adjacent node6-6 node7-6)
        (adjacent node6-7 node5-7) (adjacent node6-7 node6-6) (adjacent node6-7 node7-7) 

        (adjacent node7-1 node7-2) (adjacent node7-1 node6-1)
        (adjacent node7-2 node7-1) (adjacent node7-2 node6-2) (adjacent node7-2 node7-3)
        (adjacent node7-3 node7-2) (adjacent node7-3 node6-3) (adjacent node7-3 node7-4)
        (adjacent node7-4 node7-3) (adjacent node7-4 node6-4) (adjacent node7-4 node7-5)
        (adjacent node7-5 node7-4) (adjacent node7-5 node6-5) (adjacent node7-5 node7-6)
        (adjacent node7-6 node7-5) (adjacent node7-6 node6-6) (adjacent node7-6 node7-7)
        (adjacent node7-7 node6-7) (adjacent node7-7 node7-6)
        

        ; position relations
        (position node1-1) (position node1-2) (position node1-3) (position node1-4) (position node1-5) (position node1-6) (position node1-7) 
        (position node2-1) (position node2-2) (position node2-3) (position node2-4) (position node2-5) (position node2-6) (position node2-7)
        (position node3-1) (position node3-2) (position node3-3) (position node3-4) (position node3-5) (position node3-6) (position node3-7)
        (position node4-1) (position node4-2) (position node4-3) (position node4-4) (position node4-5) (position node4-6) (position node4-7)
        (position node5-1) (position node5-2) (position node5-3) (position node5-4) (position node5-5) (position node5-6) (position node5-7)
        (position node6-1) (position node6-2) (position node6-3) (position node6-4) (position node6-5) (position node6-6) (position node6-7)
        (position node7-1) (position node7-2) (position node7-3) (position node7-4) (position node7-5) (position node7-6) (position node7-7) 

    )

    (:goal (and
        ;head relations
        (head node2-5 b) 
        (head node3-4 y)
        (head node6-3 c)
        (head node4-2 o) (head node6-2 g)
        (head node1-1 r)
        
        ; pipe relations
        (pipe node1-7) (pipe node2-7) (pipe node3-7) (pipe node4-7) (pipe node5-7) (pipe node6-7) (pipe node7-7) 
        (pipe node3-6) (pipe node4-6) (pipe node5-6)
        (pipe node3-5) (pipe node4-5) (pipe node5-5) (pipe node6-5) 
        (pipe node1-4) (pipe node2-4) (pipe node4-4) (pipe node5-4) (pipe node6-4) (pipe node7-4)
        (pipe node1-3) (pipe node2-3) (pipe node3-3) (pipe node4-3) (pipe node5-3) (pipe node7-3)
        (pipe node1-2) (pipe node2-2) (pipe node3-2) (pipe node5-2) (pipe node7-2)
        (pipe node2-1) (pipe node3-1) (pipe node4-1) (pipe node5-1) (pipe node6-1) (pipe node7-1)
        )
    )

    (:metric 
        minimize (total-cost)
    )

)

; plan
1. (select-colour dummy r)
   deleted: (selected dummy)
   added: (selected r) (finished dummy)
   goals met: 0 of 43
2. (movenexttoedge node7-5 node7-4 r)
   added: (head node7-4 r) (pipe node7-4) (currentpath node7-4)
   goals met: 1 of 43
3. (movenexttoedge node7-4 node7-3 r)
   added: (head node7-3 r) (pipe node7-3) (currentpath node7-3)
   goals met: 2 of 43
4. (movenexttoedge node7-3 node7-2 r)
   added: (head node7-2 r) (pipe node7-2) (currentpath node7-2)
   goals met: 3 of 43
5. (movenexttoedge node7-2 node7-1 r)
   added: (head node7-1 r) (pipe node7-1) (currentpath node7-1)
   goals met: 4 of 43
6. (movenexttoedge node7-1 node6-1 r)
   added: (head node6-1 r) (pipe node6-1) (currentpath node6-1)
   goals met: 5 of 43
7. (movenexttoedge node6-1 node5-1 r)
   added: (head node5-1 r) (pipe node5-1) (currentpath node5-1)
   goals met: 6 of 43
8. (movenexttoedge node5-1 node4-1 r)
   added: (head node4-1 r) (pipe node4-1) (currentpath node4-1)
   goals met: 7 of 43
9. (movenexttoedge node4-1 node3-1 r)
   added: (head node3-1 r) (pipe node3-1) (currentpath node3-1)
   goals met: 8 of 43
10. (movenexttoedge node3-1 node2-1 r)
   added: (head node2-1 r) (pipe node2-1) (currentpath node2-1)
   goals met: 9 of 43
11. (finishpath node2-1 node1-1 r)
   deleted: (currentpath node7-4) (currentpath node7-3) (currentpath node7-2) (currentpath node2-1) (currentpath node3-1) (currentpath node4-1) (currentpath node5-1) (currentpath node6-1) (currentpath node7-1)
   added: (head node1-1 r) (nexttoedge node6-4) (nexttoedge node6-3) (nexttoedge node6-2) (nexttoedge node2-2) (nexttoedge node3-2) (nexttoedge node4-2) (nexttoedge node5-2)
   goals met: 10 of 43
12. (select-colour r o)
   deleted: (selected r)
   added: (selected o) (finished r)
   goals met: 10 of 43
13. (movenexttoedge node1-5 node1-4 o)
   added: (head node1-4 o) (pipe node1-4) (currentpath node1-4)
   goals met: 11 of 43
14. (movenexttoedge node1-4 node1-3 o)
   added: (head node1-3 o) (pipe node1-3) (currentpath node1-3)
   goals met: 12 of 43
15. (movenexttoedge node1-3 node1-2 o)
   added: (head node1-2 o) (pipe node1-2) (currentpath node1-2)
   goals met: 13 of 43
16. (movenexttoedge node1-2 node2-2 o)
   added: (head node2-2 o) (pipe node2-2) (currentpath node2-2)
   goals met: 14 of 43
17. (movenexttoedge node2-2 node3-2 o)
   added: (head node3-2 o) (pipe node3-2) (currentpath node3-2)
   goals met: 15 of 43
18. (finishpath node3-2 node4-2 o)
   deleted: (currentpath node1-4) (currentpath node1-3) (currentpath node1-2) (currentpath node2-2) (currentpath node3-2)
   added: (head node4-2 o) (nexttoedge node2-4) (nexttoedge node2-3) (nexttoedge node3-3)
   goals met: 16 of 43
19. (select-colour o c)
   deleted: (selected o)
   added: (selected c) (finished o)
   goals met: 16 of 43
20. (move node6-6 node6-5 c)
   added: (head node6-5 c) (pipe node6-5) (currentpath node6-5)
   goals met: 17 of 43
21. (movenexttoedge node6-5 node6-4 c)
   added: (head node6-4 c) (pipe node6-4) (currentpath node6-4)
   goals met: 18 of 43
22. (finishpath node6-4 node6-3 c)
   deleted: (currentpath node6-5) (currentpath node6-4)
   added: (head node6-3 c) (nexttoedge node6-6) (nexttoedge node5-5) (nexttoedge node6-5) (nexttoedge node5-4)
   goals met: 19 of 43
23. (select-colour c g)
   deleted: (selected c)
   added: (selected g) (finished c)
   goals met: 19 of 43
24. (movenexttoedge node7-6 node7-7 g)
   added: (head node7-7 g) (pipe node7-7) (currentpath node7-7)
   goals met: 20 of 43
25. (movenexttoedge node7-7 node6-7 g)
   added: (head node6-7 g) (pipe node6-7) (currentpath node6-7)
   goals met: 21 of 43
26. (movenexttoedge node6-7 node5-7 g)
   added: (head node5-7 g) (pipe node5-7) (currentpath node5-7)
   goals met: 22 of 43
27. (move node5-7 node5-6 g)
   added: (head node5-6 g) (pipe node5-6) (currentpath node5-6)
   goals met: 23 of 43
28. (movenexttoedge node5-6 node5-5 g)
   added: (head node5-5 g) (pipe node5-5) (currentpath node5-5)
   goals met: 24 of 43
29. (movenexttoedge node5-5 node5-4 g)
   added: (head node5-4 g) (pipe node5-4) (currentpath node5-4)
   goals met: 25 of 43
30. (move node5-4 node5-3 g)
   added: (head node5-3 g) (pipe node5-3) (currentpath node5-3)
   goals met: 26 of 43
31. (movenexttoedge node5-3 node5-2 g)
   added: (head node5-2 g) (pipe node5-2) (currentpath node5-2)
   goals met: 27 of 43
32. (finishpath node5-2 node6-2 g)
   deleted: (currentpath node5-7) (currentpath node6-7) (currentpath node7-7) (currentpath node5-6) (currentpath node5-5) (currentpath node5-4) (currentpath node5-3) (currentpath node5-2)
   added: (head node6-2 g) (nexttoedge node5-6) (nexttoedge node4-6) (nexttoedge node4-5) (nexttoedge node4-4) (nexttoedge node5-3) (nexttoedge node4-3)
   goals met: 28 of 43
33. (select-colour g b)
   deleted: (selected g)
   added: (selected b) (finished g)
   goals met: 28 of 43
34. (movenexttoedge node1-6 node1-7 b)
   added: (head node1-7 b) (pipe node1-7) (currentpath node1-7)
   goals met: 29 of 43
35. (movenexttoedge node1-7 node2-7 b)
   added: (head node2-7 b) (pipe node2-7) (currentpath node2-7)
   goals met: 30 of 43
36. (movenexttoedge node2-7 node3-7 b)
   added: (head node3-7 b) (pipe node3-7) (currentpath node3-7)
   goals met: 31 of 43
37. (movenexttoedge node3-7 node4-7 b)
   added: (head node4-7 b) (pipe node4-7) (currentpath node4-7)
   goals met: 32 of 43
38. (movenexttoedge node4-7 node4-6 b)
   added: (head node4-6 b) (pipe node4-6) (currentpath node4-6)
   goals met: 33 of 43
39. (movenexttoedge node4-6 node4-5 b)
   added: (head node4-5 b) (pipe node4-5) (currentpath node4-5)
   goals met: 34 of 43
40. (movenexttoedge node4-5 node4-4 b)
   added: (head node4-4 b) (pipe node4-4) (currentpath node4-4)
   goals met: 35 of 43
41. (movenexttoedge node4-4 node4-3 b)
   added: (head node4-3 b) (pipe node4-3) (currentpath node4-3)
   goals met: 36 of 43
42. (movenexttoedge node4-3 node3-3 b)
   added: (head node3-3 b) (pipe node3-3) (currentpath node3-3)
   goals met: 37 of 43
43. (movenexttoedge node3-3 node2-3 b)
   added: (head node2-3 b) (pipe node2-3) (currentpath node2-3)
   goals met: 38 of 43
44. (movenexttoedge node2-3 node2-4 b)
   added: (head node2-4 b) (pipe node2-4) (currentpath node2-4)
   goals met: 39 of 43
45. (finishpath node2-4 node2-5 b)
   deleted: (currentpath node1-7) (currentpath node2-7) (currentpath node3-7) (currentpath node4-7) (currentpath node4-6) (currentpath node4-5) (currentpath node2-4) (currentpath node4-4) (currentpath node2-3) (currentpath node3-3) (currentpath node4-3)
   added: (head node2-5 b) (nexttoedge node2-6) (nexttoedge node3-6) (nexttoedge node3-5) (nexttoedge node2-5) (nexttoedge node3-4)
   goals met: 40 of 43
46. (select-colour b y)
   deleted: (selected b)
   added: (selected y) (finished b)
   goals met: 40 of 43
47. (movenexttoedge node2-6 node3-6 y)
   added: (head node3-6 y) (pipe node3-6) (currentpath node3-6)
   goals met: 41 of 43
48. (movenexttoedge node3-6 node3-5 y)
   added: (head node3-5 y) (pipe node3-5) (currentpath node3-5)
   goals met: 42 of 43
49. (finishpath node3-5 node3-4 y)
   deleted: (currentpath node3-6) (currentpath node3-5)
   added: (head node3-4 y)
   goals met: 43 of 43
